# EXERCISE 1

<pre>Revist the sample code on data structures from week 1 which contains data in a number of different data structures, such as list[] and dict(). Using these structures within a program and see what you can convert into either a pandas's Series or DataFrame.

In [36]:
import pandas as pd
import numpy as np

In [20]:
animals  = ['elephant', 'panda', 'mouse', 'penguin']

In [21]:
df = pd.DataFrame(animals)

In [22]:
ser = pd.Series(animals)

In [23]:
df

          0
0  elephant
1     panda
2     mouse
3   penguin

In [31]:
df.columns = ["ANIMALS"]

In [32]:
df

    ANIMALS
0  elephant
1     panda
2     mouse
3   penguin

In [49]:
matrix = np.ones([5,5])

In [50]:
pd.DataFrame(matrix)

     0    1    2    3    4
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0  1.0

In [59]:
fruit = ("Apples", "Oranges", "Bananas")
fruit_df= pd.DataFrame(fruit)

In [60]:
fruit_df

         0
0   Apples
1  Oranges
2  Bananas

In [61]:
fruit_df[0][1] = "Apples"

In [62]:
fruit_df

         0
0   Apples
1   Apples
2  Bananas

In [72]:
even = {2,4,6,8,10}
odd = {1,3,5,7,9}
byThree  = {3,6,9,12,15}
numbers = {1,2,3,4,5,6,7,8,9,10}

pd.DataFrame([even, odd, byThree, numbers])

   0  1  2   3   4    5    6    7    8     9
0  2  4  6   8  10  NaN  NaN  NaN  NaN   NaN
1  1  3  5   7   9  NaN  NaN  NaN  NaN   NaN
2  3  6  9  12  15  NaN  NaN  NaN  NaN   NaN
3  1  2  3   4   5  6.0  7.0  8.0  9.0  10.0

In [104]:
person = {'name': 'Frank',
          'age':56,
          'height': 12}

In [105]:
person

{'name': 'Frank', 'age': 56, 'height': 12}

In [139]:
df = pd.DataFrame(list(person.items()))

In [140]:
df = df.transpose()

In [143]:
# Create a new variable called 'new_header' from the first row of 
# the dataset
# This calls the first row for the header
new_header = df.iloc[0] 
# take the rest of your data minus the header row
df = df[1:] 
# set the header row as the df header
df.columns = new_header 
# Lets see the 5 first rows of the new dataset
df.head()

0   name age height
1  Frank  56     12

# EXERCISE 2

<pre>Import the following .csv filePreview the document into an appropriate data structure in pandas. Using the functions available in pandas and NumPy (where they are more appropriate) output answers to the following questions:

What were the sales for P2 and B8 in Nov-18, Feb-18 and Mar-19?
In the third quarter (Oct-18 to Dec-18) what were the sales figures for London (L3 & 2) and what was the monthly percentage increase?
What were the top three months for New York (N6 and N4) and in which stores did they occur?
What was the overall lowest sales figure in which store and which month?

In [396]:
df = pd.read_csv("SalesData 1.csv")

In [397]:
df["Store ID"] = df["Unnamed: 0"]

In [398]:
df = df[["Store ID","Apr-18","May-18","Jun-18","Jul-18","Aug-18","Sep-18","Oct-18","Nov-18","Dec-18","Jan-19","Feb-19","Mar-19"]]

In [399]:
df.set_index("Store ID", inplace=False)

,Apr-18,May-18,Jun-18,Jul-18,Aug-18,Sep-18,Oct-18,Nov-18,Dec-18,Jan-19,Feb-19,Mar-19
Store ID,,,,,,,,,,,,
L3,390,345,379,353,365,326,363,459,539,474,340,343
L1,392,377,347,395,330,332,340,446,573,464,223,216
P2,250,270,300,398,376,382,306,489,552,488,298,269
N6,460,480,450,310,392,383,314,402,640,495,215,243
N4,460,480,450,387,388,320,337,478,676,408,338,263
B8,470,510,360,472,423,385,353,464,598,419,459,659

In [400]:
# a
df.loc[[2,5]][["Nov-18","Feb-19","Mar-19"]]

   Nov-18  Feb-19  Mar-19
2     489     298     269
5     464     459     659

In [401]:
# b
thirdQ = list(df[["Oct-18","Nov-18","Dec-18"]])

In [402]:
thirdQ

['Oct-18', 'Nov-18', 'Dec-18']

In [403]:
London = df.loc[df["Store ID"].str.contains("L")]

In [404]:
London[thirdQ]

   Oct-18  Nov-18  Dec-18
0     363     459     539
1     340     446     573

In [405]:
London[thirdQ].pct_change(axis=1).multiply(100)

   Oct-18     Nov-18     Dec-18
0     NaN  26.446281  17.429194
1     NaN  31.176471  28.475336

In [406]:
# c
df

,Store ID,Apr-18,May-18,Jun-18,Jul-18,Aug-18,Sep-18,Oct-18,Nov-18,Dec-18,Jan-19,Feb-19,Mar-19
0,L3,390,345,379,353,365,326,363,459,539,474,340,343
1,L1,392,377,347,395,330,332,340,446,573,464,223,216
2,P2,250,270,300,398,376,382,306,489,552,488,298,269
3,N6,460,480,450,310,392,383,314,402,640,495,215,243
4,N4,460,480,450,387,388,320,337,478,676,408,338,263
5,B8,470,510,360,472,423,385,353,464,598,419,459,659

In [407]:
df_trans = df

In [408]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [409]:
df_trans.set_index("Store ID", inplace=True)

In [410]:
df_trans = df.transpose()

In [411]:
df_trans

Store ID   L3   L1   P2   N6   N4   B8
Apr-18    390  392  250  460  460  470
May-18    345  377  270  480  480  510
Jun-18    379  347  300  450  450  360
Jul-18    353  395  398  310  387  472
Aug-18    365  330  376  392  388  423
Sep-18    326  332  382  383  320  385
Oct-18    363  340  306  314  337  353
Nov-18    459  446  489  402  478  464
Dec-18    539  573  552  640  676  598
Jan-19    474  464  488  495  408  419
Feb-19    340  223  298  215  338  459
Mar-19    343  216  269  243  263  659

In [412]:
df_trans.sort_values("N6", ascending=False, inplace=True)

In [413]:
best_N6 = dict(df_trans.iloc[:3]["N6"])

In [414]:
best_N6

{'Dec-18': 640, 'Jan-19': 495, 'May-18': 480}

In [415]:
df_trans.sort_values("N4", ascending=False, inplace=True)

In [416]:
best_N4 = dict(df_trans.iloc[:3]["N4"])

In [450]:
best_N4

{'Dec-18': 676, 'May-18': 480, 'Nov-18': 478}

In [451]:
# d 
minimum_val = df_trans.values.flatten()

In [452]:
minimum_val = minimum_val.min()

In [453]:
# taken from https://thispointer.com/python-find-indexes-of-an-element-in-pandas-dataframe/
def getIndexes(dfObj, value):
    listOfPos = list([value])
    # Get bool dataframe with True at positions where the given value exists
    result = dfObj.isin([value])
    # Get list of columns that contains the value
    seriesObj = result.any()
    columnNames = list(seriesObj[seriesObj == True].index)
    # Iterate over list of columns and fetch the rows indexes where value exists
    for col in columnNames:
        rows = list(result[col][result[col] == True].index)
        for row in rows:
            listOfPos.append((row, col))
    # Return a list of tuples indicating the positions of value in the dataframe
    return listOfPos

In [454]:
getIndexes(df_trans, minimum_val)

[215, ('Feb-19', 'N6')]

# Exercise 3

Using the data set from exercise 2, above, create a new data table, including headings, that gives the percentage increase for each month, based on the stores average for the year. From this ascertain:

Which store had the largest and smallest increase and in which months did they occur?
Across all the stores which months showed the smallest average increase and the largest average increase?

In [495]:
new_df = df.transpose()

In [512]:
dsc = new_df.describe()

In [513]:
new_df

Store ID   L3   L1   P2   N6   N4   B8  Mean
Apr-18    390  392  250  460  460  470   NaN
May-18    345  377  270  480  480  510   NaN
Jun-18    379  347  300  450  450  360   NaN
Jul-18    353  395  398  310  387  472   NaN
Aug-18    365  330  376  392  388  423   NaN
Sep-18    326  332  382  383  320  385   NaN
Oct-18    363  340  306  314  337  353   NaN
Nov-18    459  446  489  402  478  464   NaN
Dec-18    539  573  552  640  676  598   NaN
Jan-19    474  464  488  495  408  419   NaN
Feb-19    340  223  298  215  338  459   NaN
Mar-19    343  216  269  243  263  659   NaN

In [531]:
mean = dsc.loc['mean'][0:]

In [540]:
new_df = new_df.append(mean)

In [544]:
new_df = new_df.drop(columns="Mean")

In [545]:
new_df

Store ID,L3,L1,P2,N6,N4,B8
Apr-18,390.000000,392.000000,250.000000,460.000000,460.000000,470.000000
May-18,345.000000,377.000000,270.000000,480.000000,480.000000,510.000000
Jun-18,379.000000,347.000000,300.000000,450.000000,450.000000,360.000000
Jul-18,353.000000,395.000000,398.000000,310.000000,387.000000,472.000000
Aug-18,365.000000,330.000000,376.000000,392.000000,388.000000,423.000000
Sep-18,326.000000,332.000000,382.000000,383.000000,320.000000,385.000000
Oct-18,363.000000,340.000000,306.000000,314.000000,337.000000,353.000000
Nov-18,459.000000,446.000000,489.000000,402.000000,478.000000,464.000000
Dec-18,539.000000,573.000000,552.000000,640.000000,676.000000,598.000000
Jan-19,474.000000,464.000000,488.000000,495.000000,408.000000,419.000000
Feb-19,340.000000,223.000000,298.000000,215.000000,338.000000,459.000000
Mar-19,343.000000,216.000000,269.000000,243.000000,263.000000,659.000000
mean,389.666667,369.583333,364.833333,398.666667,415.416667,464.333333

In [553]:
new_index = ["mean","Apr-18","May-18","Jun-18","Jul-18","Aug-18","Sep-18","Oct-18","Nov-18","Dec-18","Jan-19","Feb-19","Mar-19"]

In [559]:
new_df = new_df.reindex(new_index)

### the percentage increase for each month, based on the stores average for the year.

In [564]:
pct_mean = new_df.pct_change(axis=0).multiply(100)
pct_mean

Store ID         L3         L1         P2         N6         N4         B8
mean            NaN        NaN        NaN        NaN        NaN        NaN
Apr-18     0.085543   6.065389 -31.475560  15.384615  10.732197   1.220388
May-18   -11.538462  -3.826531   8.000000   4.347826   4.347826   8.510638
Jun-18     9.855072  -7.957560  11.111111  -6.250000  -6.250000 -29.411765
Jul-18    -6.860158  13.832853  32.666667 -31.111111 -14.000000  31.111111
Aug-18     3.399433 -16.455696  -5.527638  26.451613   0.258398 -10.381356
Sep-18   -10.684932   0.606061   1.595745  -2.295918 -17.525773  -8.983452
Oct-18    11.349693   2.409639 -19.895288 -18.015666   5.312500  -8.311688
Nov-18    26.446281  31.176471  59.803922  28.025478  41.839763  31.444759
Dec-18    17.429194  28.475336  12.883436  59.203980  41.422594  28.879310
Jan-19   -12.059369 -19.022688 -11.594203 -22.656250 -39.644970 -29.933110
Feb-19   -28.270042 -51.939655 -38.934426 -56.565657 -17.156863   9.546539
Mar-19     0.882353  -3.139013  -9.731544  13.023256 -22.189349  43.572985

### store that had the largest and smallest increase and in which months did they occur

In [585]:
max_increase = pct_mean.describe()
max_increase = max_increase.loc["max"]

In [586]:
max_index = pct_mean.idxmax()

In [589]:
frame = { 'Max Increase (%)': max_increase, 'Month': max_index } 
result = pd.DataFrame(frame) 
result

          Max Increase (%)   Month
Store ID
L3               26.446281  Nov-18
L1               31.176471  Nov-18
P2               59.803922  Nov-18
N6               59.203980  Dec-18
N4               41.839763  Nov-18
B8               43.572985  Mar-19

In [587]:
min_increase = pct_mean.min()
min_index = pct_mean.idxmin()
frame2 = { 'Min Increase (%)': min_increase, 'Month': min_index } 
result2 = pd.DataFrame(frame2) 
result2

          Min Increase (%)   Month
Store ID
L3              -28.270042  Feb-19
L1              -51.939655  Feb-19
P2              -38.934426  Feb-19
N6              -56.565657  Feb-19
N4              -39.644970  Jan-19
B8              -29.933110  Jan-19

### Across all the stores which months showed the smallest average increase and the largest average increase?

In [610]:
print("Largest Average increase")
result.max()

Largest Average increase

Max Increase (%)    59.8039
Month                Nov-18
dtype: object

In [609]:
print("Smallest Average increase")
result2.min()

Smallest Average increase

Min Increase (%)   -56.5657
Month                Feb-19
dtype: object